In [1]:
import pandas as pd

In [34]:
df = pd.read_csv('twa_example.csv')

In [35]:
df['ma_5'] = df['value'].rolling(5).mean()

df['ma_15'] = df['value'].rolling(15).mean()
df['ma_40'] = df['value'].rolling(40).mean()

In [37]:
df.tail()

,date,value,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,ma_5,ma_15,ma_40
71,5-Feb,16.875,NaN,NaN,NaN,NaN,NaN,16.325,13.483333,13.343125
72,12-Feb,18.000,NaN,NaN,NaN,NaN,NaN,17.050,13.900000,13.426875
73,19-Feb,17.750,NaN,NaN,NaN,NaN,NaN,17.425,14.250000,13.536875
74,26-Feb,18.875,NaN,NaN,NaN,NaN,NaN,17.900,14.691667,13.702500
75,5-Mar,20.375,13.89,13.75,NaN,NaN,NaN,18.375,15.325000,13.903125